import React from "react";
import { Container } from "@mui/material";
import "../../../assets/css/terms.css";
import { Link } from "react-router-dom";

const Data = [
  {
    title: "شروط الاتفاقية",
    explain:
      "عبر وصولك واستخدامك تطبيق و موقع Maktab فإنك توافق على قبولك، من غير تعديل أو قيود أو شروط على جميع الأحكام والشروط الواردة في هذه الاتفاقية. أنت تقر وتضمن حقك القانوني للدخول في هذه الاتفاقية واستخدام الموقع وفقاً لجميع الشروط والأحكام المتواجدة هنا.",
  },
  {
    title: "تعديل الشروط",
    explain:
      "يعمل تطبيق و موقع Maktab قدر الإمكان على توفير المعلومات على الموقع و التطبيق بأكبر دقة ممكنة. مع ذلك، فإن بعض الأخطاء قد تحدث من وقت لآخر. إن تطبيق و موقع Maktab وأي من شركائنا لا نتحمل أي مسؤولية عن أي خطأ في المعلومات التي يتضمنها الموقع أو التطبيق يتضمن الموقع و التطبيق معلومات حول الخدمات والمنتجات التي يوفرها تطبيق و موقع Maktab وأي طرف آخر. إن المعلومات والمواد الأخرى على الموقع و التطبيق مقدمة بأمانة تامة. عبر استخدامك الموقع أو التطبيق فإنك توافق وتقر بأنه قد يقوم الموقع  أو التطبيق بعمل أي تحديث، تغيير أو تعديل الشروط والأحكام أو سياسة خدمة العملاء، أو أي معلومات مقدمة، في أي وقت بدون سابق إنذار. ان الشروط والأحكام تصبح سارية المفعول بمجرد نشرها على الموقع و التطبيق، ولن يكون لها أي أثر رجعي على أي حجوزات تمت مسبقا من خلاله. يجب عليك قراءة هذه الشروط والأحكام في كل مرة تقوم بزيارة الموقع أو التطبيق لضمان أنك على علم بكل الشروط والأحكام السابقة. وفقاً لذلك، الاستمرار باستخدامك للموقع أو التطبيق يعتبر موافقة منك على أي تغيير في الشروط والأحكام.",
  },
  {
    title: "شروط الحجز",
    explain:
      "عندما يتم الحجز عن طريق تطبيق و موقع Maktab ، فإنك تلتزم وتوافق كلياً على جميع شروط الحجز المفروضة من مكان الإقامة، والتي تضم قوانين الإلغاء وعدم الحضور، وأي شروط أخرى تفرض عليك أثناء الإقامة أو الحجز، بما في ذلك الخدمات المتاحة و/أو المنتجات التي يوفرها مكان الإقامة (من الممكن تحصيل الشروط والأحكام الإضافية الخاصة من مكان الإقامة المحدد)",
  },
  {
    title: "الوصول متأخر أو عدم الحضور",
    explain:
      "ينبغي عليك التواصل مع تطبيق و موقع Maktab في حال رغبت بإلغاء حجز ك (القابل للالغاء) قبل حلول موعد الحجز، ولكن إذا احتمل تأخر وصولك عن موعد تسجيل الدخول أو في عدم إمكانية التسجيل في يوم حجزك فعليك التواصل مباشرة مع مكان الإقامة وإخبارهم بذلك. وإذا اخفقت في تسجيل الدخول لمكان الإقامة في يوم الحجز دون إخبارهم بذلك، فقد يتم إلغاء الفترة المتبقية من حجزك وقد لا تكون مخولاً لاسترداد أموالك، وذلك وفقاً للشروط والاحكام الخاصة بمكان الإقامة.",
  },
  {
    title: "تغيير أو إلغاء الحجز",
    explain:
      "تختلف سياسة إلغاء الحجز بين أماكن الإقامة. فبعض الحجوزات غير قابلة للتغيير أو الإلغاء، وقد تفرض بعض أماكن الإقامة رسوماً معينة على إلغاء الحجز، بينما يتيح بعضها الآخر استرداد مبلغ الحجز بالكامل. يرجى الملاحظة بأن بعض الحجوزات بأسعار معينة أو عروض خاصة غير مؤهلة للتغيير أو الإلغاء. كما قد تقوم بعض أماكن الإقامة بتطبيق رسوم إضافية على المغادرة المبكرة أو المتأخرة. تتوفر سياسة تغيير الحجز أو الإلغاء الخاصة بمكان الإقامة على صفحة معلومات الموقع الالكتروني لمكان الإقامة أو تحت بند شروط الحجز، سياسة الإلغاء أو ما شابه ذلك، وفي رسالة تأكيد الحجز الإلكترونية ووصل الحجز. ننصحك بالتأكد من وقراءة سياسة الإلغاء وسياسة عدم الحضور الخاصة بمكان الإقامة قبل إتمام عملية الحجز. بغض النظر عن سياسة تغيير أو إلغاء الحجز لمكان الإقامة، يحتفظ تطبيق و موقع Maktab بالحق في فرض رسوم معينة على تغيير أو إلغاء الحجز، وذلك كما هو مبين في الموقع. يرجى التأكد من تفاصيل الشروط والأحكام الخاصة بمكان الإقامة قبل القيام بالحجز. إذا رغبت باستعراض، تعديل أو إلغاء حجزك، يرجى الرجوع إلى رسالة تأكيد الحجز الإلكترونية واتباع التعليمات الواردة بها أو التواصل مع فريق خدمة عملاء تطبيق و موقع ",
  },
  {
    title: "في المكتب ",
    explain:
      "إذا لم تتوفر بعض المرافق التي تم حجزها بناءً على طلبك لدى وصولك لمكان إقامتك، ننصحك بتقديم شكوى إلى إدارة مكان الإقامة. ولكن تطبيق و موقع Maktab لا تعدك أو تضمن لك توافر أي من المرافق التي قمت بطلبها مسبقاً.",
  },
  {
    title: " توافر الموقع / التطبيق ",
    explain:
      "يستخدم تطبيق و موقع Maktab كل الوسائل لضمان جاهزية الموقع و التطبيق واتاحة كل الخدمات المرتبطة به، ولكن لا يمكن لها أن تضمن عمله بشكل مستمر أو بدون انقطاع. إخلاء مسؤولية عن الضمانات و تحديد المسؤولية إن تطبيق و موقع Maktab لا ملك أي ضمانات، سواء صريحة أو ضمنية، بخصوص محتوى الموقع و التطبيق، ويملك الحق بالتنازل عن جميع الضمانات وذلك وفقا لأقصى مدى متاح في القانون المعمول به. إن وصولك واستخدامك للبرمجيات وغيرها من المواد، أو من خلال الموقع أو التطبيق، يقع على مسؤوليتك الشخصية. إن تطبيق و موقع Maktab لا تقدم أية ضمانات حول الدقة أو الخلو من الفيروسات لمثل هذه البرامج. مع مراعاة القانون المعمول به، تحت أي ظرف من الظروف ان تطبيق و موقع Maktab والجهات المرخصة لها والموردين ومقدمي الخدمات لا يتحملون أي مسؤولية مباشرة أو غير مباشرة أو عرضية أو خاصة أو تأديبية أو تعويضات تبعية أو رادعة من أي نوع (بما في ذلك على سبيل المثال لا لحصر خسارة الأرباح أو المدخرات المفقودة أو الإيرادات، أو فقدان أو تلف البيانات أو المعلومات) التي تنشأ مع أي وسيلة اتصال باستخدام أو عدم القدرة على استخدام تطبيق و موقع Maktab سواء على أساس الإخلال بالعقد أو الضرر أو الإهمال أو المسؤولية عن المنتجات أو غير ذلك، حتى لو تم اعلامك عن امكانية حدوث أي أضرار. هذا يتضمن أي معلومات، منتجات أو خدمات يتم الحصول عليها أو عبر أي اتصال على الموقع أو التطبيق.",
  },
  {
    title: "الاستخدام المقبول",
    explain: "عند استخدام موقع تطبيق و موقع Maktab تعلن وتوافق على:",
    list: [
      "استخدامه فقط لتحديد مدى توفر الخدمات والمنتجات المتوفرة في الموقع ولمساعدتك لجعل الحجوزات شرعية أو مزاولة الأعمال التجارية معنا. أنت توافق على استخدام الموقع  و التطبيق فقط للاستخدام الشخصي وغير التجاري.",
      "استخدام خدمات الموقع فقط للحجوزات الشرعية",
      "أن تبلغ على الأقل 18عاماً وتملك الحق الشرعي لإنشاء التزام قانوني",
      "ستقوم بإعلام كل الأشخاص الآخرين الذين سوف تقوم بالحجز بالنيابة عنهم عن الأحكام التي استخدمت بالحجز الذي قمت به ، بما في ذلك جميع القواعد والقيود المطبقة عليها.",
      "عدم إجراء أي حجز وهمي أو تخميني أو تحسباً للطلب. من الممكن لتطبيق و موقع Maktab أن يقوم بالإلغاء، وبدون سابق إنذار، كل الحجوزات إلى جهة أو جهات متعددة و في نفس التاريخ",
      "عدم تشويه، تغيير الواجهة الأمامية لمظهر الموقع أو البرنامج الأساسي.",
      "عدم القيام بأي عمل قد يؤدي الى أي حدوث ضغط غير محتمل أو غير متناسب للموقع أو التطبيق أو البنية التحتية الخاصة به.",
      "تقع على مسؤوليتك الشخصية التقيد بجميع شروطنا و أحكامنا الخاصة والتي تتضمن ،على سبيل المثال لا الحصر، الدفع الكامل وفي الوقت المناسب لجميع المبالغ المستحقة مع الامتثال لجميع القواعد المتعلقة حول توفر الأسعار ، المنتجات، أو الخدمات، جميع الرسوم.",
      "عدم فعل أي شيء قد يسبب الضرر ،او يتعارض مع، أو يشوش الوصول أو يضر بتوفر المحتوى على الموقع، عدم تحميل أي ملفات تحمل فيروسات للكمبيوتر أو أي رموز أخرى ، أو برامج معدة لاعتراض، أو تدمير أو الحد من وظيفة الموقع أو التطبيق .",
      "عدم نشر، توزيع أو تحميل أي مواد تشهيرية، هجومية، انتهاكية، مضرة، تهديدية، مسيئة، ملتوية أو عنصرية ،أو غير ملائمة أخلاقياً أو غير ذلك من محتوى أو معلومات غير قانونية أو إرسال أي سلسلة رسائل بريد إلكتروني غير مرغوب به ، أو مواد السبام أو أي شكل آخر من أشكال التواصل بكميات كبيرة.",
      "عدم تهديد, إزعاج, إساءة ,تشويش, أو الاعتداء على حقوق الآخرين ,بما في ذلك حقوقهم الفردية.",
      "عدم الحصول أو محاولة الحصول على دخول غير مصرح به للموقع أو أي حساب لعضو متواجد على الموقع ،أو انتحال أي شخصية أو تحريف العضوية مع شخص آخر",
      "عدم القيام، التسبب أو السماح بأي شئ من الممكن أن ينتهك الضرر أو يتضارب مع حقوق الملكية الفكرية للموقع أو أي من شركاتنا المرتبطة أو أطراف أخرى.",
      "أيضا , عدم القيام بأي شيء غير قانوني من الممكن أن يخلق أي مسؤولية من جانب تطبيق و موقع Maktab",
      "عدم الاعتداء على هذه الاتفاقية أو أي تشريع معمول به بأي طريقة.",
      "عدم تحميل أو إرفاق أي ملفات أو برامج أو أي مواد أخرى محمية من قبل قوانين حقوق الملكية الفكرية أو( أي حقوق خاصة أو عامة) ما لم يملك المستخدم الحقوق أو يستلم التفويض والموافقة لاستخدامها كما هو متطلب من القانون.",
      "عدم تحميل أو إرفاق أي ملفات تحتوي على أي فيروسات أو ملفات تالفة أو أي برمجيات مشابهة أو برامج من الممكن أن تسبب الضرر لعمل كمبيوتر آخر.",
      "عدم القيام بمسح حق المؤلف أو إشعارات قانونية أو تسميات للملكية في أي ملف تم تحميله.",
      "عدم القيام بتزوير أصل أو مصدر البرمجيات أو المواد الأخرى الذي يتضمنها الملف الذي تم تحميله.",
      "عدم الإعلان عن أو عرض بيع أي بضائع أو خدمات ، أو إجراء أو إرسال دراسات استقصائية، مسابقات أو سلسلة رسائل، أو تحميل أي ملف ينشر من قبل مستخدم آخر ، وينبغي العلم انه لا يسمح بالترويج لها بهذه الطرق قانونياً.",
      "عدم استخدام هذا الموقع أو التطبيق وأي من محتوياته لمثل هذا الغرض.",
      "عدم الوصول أو مراقبة أو نسخ أي محتوى أو معلومة من هذا الموقع باستخدام أي روبوت أو سبايدر أو سكرابر أو أي وسائل آلية أخرى أو أي عملية يدوية بدون الإذن الكتابي الصريح.",
      "عدم انتهاك القيود على الموقع أو التطبيق أو أي تجاوز أو تحايل لخرق التدابير الأخرى المستخدمة بهدف منع أو تقييد الوصول لهذا الموقع",
      "عدم اتخاذ أي إجراء يفرض، أو قد يفرض ، في تقديرنا عبئا غير محتمل أو غير متناسب مع البنية التحتية للموقع أو التطبيق .",
      "عدم القيام بعمل رابط عميق لأي جزء من هذا الموقع لأي غرض بدون الإذن الكتابي الصريح من طرفنا أو القيام بدمج أي جزء من هذا الموقع إلى أي موقع آخر دون الحصول على إذن كتابي مسبق.",
      //   "عدم إضافة، عرض ، تحميل ، تعديل، نشر ، نقل ، تحديث أو مشاركة مما يلي:",
      "القيام بتحذيرك أنك قمت بخرق هذه الشروط والأحكام , والطلب منك بالتوقف عن هذا السلوك.",
      "حذف أي مواد أو محتوى من الممكن أنك قمت بنشره بدون القيام بإنذارك.",
      "اتخاذ تدابير (من ضمنها إيقاف، تعليق أو تقييد وصولك ) ومنعك من استخدام الموقع و التطبيق.",
      "إلغاء أي حجوزات من الممكن أن تكون قد قمت بها من دون الرجوع اليك.",
      "التبليغ عن الأنشطة الخاصة بك الى مزودي خدمة الإنترنت أو السلطات المختصة.",
      "اتخاذ إجراءات قانونية ضدك.",
    ],
    InternalList: [
      "المعلومات التي تخص شخصا آخر والتي لا يملك المستخدم أي حق بالاحتفاظ بها.",
      "المعلومات غير المرغوبة، التي تسبب ضررا جسيما للقصر ،أو العنصرية أو التي تعتدي على خصوصية الآخرين ،او المكروهة عرقيا ،أو التي تحط وتشجع على غسيل الأموال أو القمار",
    ],
  },
  {
    title: "حقوق الطبع و النشر و العلامات التجارية",
    explain:
      "تخضع جميع محتويات تطبيق و موقع Maktab لحقوق الطبع والنشر إن الموقع و التطبيق ,  متوفر للاستخدام الشخصي وليس التجاري. أنت لا تستطيع تعديل، نسخ، توزيع، إرسال ، عرض، تنفيذ، إعادة إنتاج أو نشر أو إنشاء أعمال مشتقة ، نقل أو بيع أي معلومات، أو برامج، أو منتجات أو خدمات تم الحصول عليها من الموقع . إن الموقع واسماء الشركات الشريكة، وأي منتج آخر أو اسم تجاري يتعلق بتطبيق و موقع Maktab هو من علاماتنا أو من علاماتنا التجارية المسجلة. ان المنتجات الأخرى وأسماء الشركات المشار إليها في الموقع و التطبيق هي العلامات التجارية الخاصة بمالكيها.",
  },
  {
    title: "التعويض و تحديد المسؤولية",
    explain:
      "كشرط لاستخدام هذا التطبيق و الموقع، إنك توافق على درء الضرر عنا وتعويضنا عن أي وكافة الالتزامات والخسائر والدعاوى والنفقات (بما في ذلك الرسوم القانونية) والأضرار (سواء المباشرة أو غير المباشرة) التي تنشأ عن المطالبات الناتجة عن استخدامك لهذا الموقع أو التطبيق، بما في ذلك ودون حصر أي مطالبات تتضمن مزاعم تثبت صحتها وتشكل انتهاكاً من جانبك لهذه الاتفاقية. الممكن لتطبيق و موقع Maktab أن يقدم إليك الإشعارات وبيانات التواصل عبر البريد الالكتروني، البريد العادي ، أو عبر الموقع أو بأي وسيلة أخرى. باستثناء ما هو منصوص عليه خلافا لهذا القانون، الإشعارات الى بتطبيق و موقع Maktab يجب أن تُرسل عبر الساعي إلى عنوان المكتب المسجل والمتواجد في طريق عثمان بن عفان، حي الواحة، بجانب نادي نيو يو, الرياض، السعودية.إذا كنت غير راض عن أي جانب من الموقع أو التطبيق إذا كان لديك أي شكوى من أي خدمة مقدمة يمكنك التواصل معنا بخصوصها.",
  },
];

const TermsOfUse = () => {
  return (
    <Container>
      <h1 className="TermsTitle">شروط الاستخدام</h1>
      {Data.map((ele, index) => (
        <div key={index}>
          <p className="mt-3 font-bold">{ele.title}</p>
          <p className="mt-3">{ele.explain}</p>
          {ele.list && ele.list.length > 0 && (
            <ul className="mt-3">
              {ele.list.map((item, itemIndex) => (
                <li key={itemIndex}>
                  {" "}
                  <span className="list-marker">&#8226;</span>
                  {item}
                </li>
              ))}
            </ul>
          )}
        </div>
      ))}
      <p className="font-bold mt-5">
        ارسل رسالة عن طريق نموذج التواصل في الموقع
        <Link to="/contact-us" className="mr-3 color-green">
          هنا contact us
        </Link>
      </p>
    </Container>
  );
};

export default TermsOfUse;
