import React from "react";
import "../../../assets/css/terms_office.css";

const TermOfService = () => {
  return (
    <div className="terms_container">
      <div className="inside_div">
        <p className="maktab_title">إتفاقية إستخدام منصة مكتب</p>
        <p>
          بعون الله وتوفيقه تم الإتفاق في يوم (Monday) وتاريخ (2024/01/01)بين
          كلٍ من{" "}
        </p>
        <p>
          <b>شركة السحابة العاشرة لتقنية المعلومات ( مكتب) </b>بموجب السجل
          التجاري رقم (0000000) وتاريخ 0/0/1000 صادر من الرياض، ويقع مقرها
          الرئيسي في الرياض، المملكة العربية السعودية، و عنوانها 000 طريق عثمان
          بن عفان, حي الواحة 000, هاتف رقم (000000) وعنوان البريد الإلكتروني{" "}
        </p>
        <b>ويشار إليها فيما بعد بـــــ (الطرف الأول أو مكتب أو المنصة)</b>
        <p>
          السيد/ مستخدم جديد - جاري التحقق , ، وعنوانه: المملكة العربية
          السعودية، ,جدة حي حي ... هاتف رقم (00000)،, وعنوان البريد الإلكتروني
          (ramaa.alhussein@gmail.com).
        </p>
        <b>ويُشار إليه فيما بعد بـــــ (الطرف الثاني أو المضيف)</b>
        <p>
          حيث أن الطرف الأول لديه منصة إلكترونية لحجز و عرض مكاتب على سبيل
          المثال لا الحصر ( )، مرخصة من وزارة السياحة، و حيث أن الطرف الثاني
          يملك أو يدير مكتبا معداً للتأجير و يرغب بالإعلان عنه في منصة الطرف
          الأول، لذا إتفق الطرفان وهما بكامل أهليتهما المعتبرة شرعاً ونظاماً على
          إبرام هذة الاتفاقية وفقاً للآتي:
        </p>
        <b>الماد (1): تمهيد:</b>
        <p>
          يُعتبر التمهيد أعلاه جزءاً لا يتجزأ من هذة الاتفاقية ومكملاً ومتمماً
          لها
        </p>
        <b>المادة (2): الغرض من هذة الاتفاقية:</b>
        <p>
          أبرمت هذة الاتفاقية لغرض قيام الطرف الثاني بالإعلان عن مكتبه في منصة
          الطرف الأول أو في منصات آخرى كما يراه الطرف الأول مناسبا وفقاً لنطاق
          الأمور المتفق عليها في هذة الاتفاقية وبعمولة متفق عليها من قبل
          الطرفين.
        </p>
        <b>المادة (3): إلتزامات و حقوق الطرف الأول:</b>
        <ul>
          <li>
            يلتزم الطرف الأول بتحصيل العربون أو كامل المبلغ من العميل، أما
            إستكمال باقي المبلغ (إن وجد) و مبلغ التأمين على العقار، يعتبر من
            إلتزامات الطرف الثاني.
          </li>
          <li>
            يلتزم الطرف الأول بإخبار الطرف الثاني بأي مستجدات في المنصة المتعلقة
            بطريقة إستخدامها للطرف الثاني.
          </li>
          <li>يحق للطرف الأول عرض العقار بما يتناسب مع معاييره و متطلباته.</li>
          <li>
            يلتزم الطرف الأول بتطبيق سياسة الإلغاء التي يختارها الطرف الثاني في
            المنصة و سيعتمدها الطرف الأول لديه كسياسة إلغاء و إسترجاع للحجوزات.
            و لايحق للطرف الثاني الرجوع عنها بعد إتمام الحجز.
          </li>
        </ul>
        <b>المادة (4): إلتزامات الطرف الثاني:</b>
        <ul>
          <li>
            كل المعلومات التي سيُعلن عنها الطرف الثاني في منصة الطرف الأول ستكون
            ظاهرة للعملاء وسيُعتمد عليها لإجراء الحجوزات. لذلك يلتزم الطرف
            الثاني بأن يبيّن كافة المعلومات الصحيحة و الدقيقة للعقار بما في ذلك
            على سبيل المثال لا الحصر (الأسعار والتوافر والصور ووصف المكان و
            المرافق والخدمات التي يقدمها و شروط الحجز و غيرها من المعلومات التي
            تخص العقار)، و يلتزم بمتابعة وتجديد بيانات عقاره في حال حدث أي تغيير
            من قبله،
            <span style={{ color: "red" }}>
              فهو المسؤول عن صحة هذة المعلومات .
            </span>
          </li>
          <li>
            يجب أن
            <span style={{ color: "red" }}>
              تكون الأسعار المعروضة في المنصة تساوي أو أقل من الأسعار خارج
              المنصة
            </span>
            و لا يجوز أن تكون الأسعار في المنصة أعلى.
          </li>
          <li>
            <span style={{ color: "red" }}>
              يلتزم الطرف الثاني بتوفير ما تم حجزه في تاريخ الحجز عن طريق
              المنصة،{" "}
            </span>
            <span>
              {" "}
              و أن يبذل قصارى جهده في ذلك، وفي حال تعذّر تسليم العين المحجوز ة
              لظروف قاهرة في ذات اليوم، سيقوم الطرف الأول بعمل حجز آخر بقيمة
              150٪ من قيمة الحجز الأصلي، و سيتحمل الطرف الثاني قيمة 50% من الحجز
              الآخر.{" "}
            </span>
          </li>
          <li>
            لا يحق للطرف الثاني إلغاء أي حجز تم عن طريق الطرف الأول، و إذا ألغى
            الطرف الثاني الحجز حق للطرف الأول إعادة مبلغ العربون كاملاً للعميل،
            و يحق للطرف الأول في هذة الحالة خصم عمولته من حساب الطرف الثاني
            الموجود لدى الطرف الأول.
          </li>
        </ul>
        <b>المادة (5): العمولة وسداد المبلغ:</b>
        <ul>
          <li>
            تكون عمولة الطرف الأول مقابل كل حجز للطرف الثاني هي 13.04% من قيمة
            الإيجار. ( غير شاملة ضريبة القيمة المضافة)
          </li>
          <li>
            في حال لم يحضر العميل تحسب عمولة الطرف الأول من العربون و ليس من
            قيمة الإيجار.
          </li>
          <li>
            تصدر الفاتورة في تاريخ مغادرة العميل. وتحسم العمولة المتفق عليها و
            تحول المبالغ بعد 48 ساعة من تاريخ مغادرة العميل على حساب الطرف
            الثاني لدى (stcpay).
          </li>
        </ul>
        <b>المادة (6): الأحداث القهرية والضرر:</b>
        <ul>
          <li>
            لا يتحمل الطرف الأول أي مسؤولية عن إتلاف أو تخريب أو سرقة العقار أو
            المتبقي من المبلغ وما إلى ذلك من ممتلكات الطرف الثاني حيث أن مبلغ
            التأمين يدفع للطرف الثاني فهو المخول بمطالبة العميل عن أي تعويض
          </li>
          <li>
            يخلي الطرف الأول مسؤوليته عن أي حوادث تقع داخل العين المحجوزة من موت
            لا سمح الله أو غرق أو حريق أو جناية أو مداهمة حيث أن ثبوتيات العميل
            تكون بحوزة الطرف الثاني وهو المتصرف بها.
          </li>
        </ul>
        <b>المادة (7): مدة الاتفاقية:</b>
        <ul>
          <li>
            تسري هذة الاتفاقية ما دام عقار الطرف الثاني معروضاً على المنصة و
            تنتهي و تفسخ هذة الاتفاقية بمجرد تغيير حالة عرض عقار الطرف الثاني
            إلى غير معروض.
          </li>
          <li>
            في حال رغب أي من الطرفين فسخ و إلغاء الاتفاقية، يتم تسوية كافة
            الاستحقاقات و إلغاء الاتفاقية.
          </li>
        </ul>
        <b>المادة (8): أحكام عامة:</b>
        <ul>
          <li>
            تسري على كل ما لم يرد فيه نصٌ خاص في هذة الاتفاقية الأنظمة واللوائح
            والتعليمات والقرارات والتنظيمات ذات العلاقة السارية في المملكة
            العربية السعودية أثناء إبرام هذة الاتفاقية أو خلال فترة سريانها.
          </li>
        </ul>
        <b>المادة (9): الإشعارات:</b>
        <ul>
          <li>
            توجَّه كافة المراسلات والإشعارات والإخطارات المتعلقة بهذة الاتفاقية
            أو أي جزءٍ منها إلى العناوين المنوه عنها في مقدمة هذة الاتفاقية،
            وتُعد مستلمة حُكماً ومُنتجةً لآثارها القانونية إذا ثبت توجيهها
            وإرسالها إلى تلك العناوين بما في ذلك عنوان البريد الإلكتروني و
            تنبيهات تطبيق الجوال (جاذر إن للأعمال).
          </li>
        </ul>
        <b>المادة (10): النزاعات والخلافات:</b>
        <ul>
          <li>
            في حال نشوء نزاع بين أطراف هذة الاتفاقية أو بينهم وبين ورثة أحدٍ
            منهم أو خُلفائه من بعده وكان النزاع متعلقاً بهذة الاتفاقية أو ما
            ينشأ عنها أو بسببها من حقوقٍ أو التزامات، يتم حل هذا النزاع بالطرق
            الودِّية.
          </li>
          <li>
            في حال تعذر حل النزاع بين أطراف هذة الاتفاقية أو بينهم وبين ورثة
            أحدٍ منهم أو خُلفائه من بعده بالطرق الودية خلال (15) يوماً تقويمياً
            من تاريخ نشوء النزاع؛ يكون الاختصاص الولائي بالفصل في النزاع للمحكمة
            المختصة في مدينة الرياض.
          </li>
        </ul>
        <b>المادة (11): نسخ الاتفاقية:</b>
        <p>
          حُرر ت هذة الاتفاقية من نسختين أصليتين متساويتان في القوة والحجية
          تتكون كل نسخة من إحدى عشر (11) مادة، وإستلم كل طرفٍ نسخة إلكترونية منه
          بعد الموافقة عليها إلكترونياً لتنفيذها والعمل بموجبها، ويُعد تاريخ
          موافقة الطرف الثاني هو تاريخ بدء سريان هذه الاتفاقية. والله الموفق،،،
        </p>
        <b>ويُشار إليه فيما بعد بـــــ (الطرف الثاني أو المضيف)</b>
        <p>
          حيث أن الطرف الأول لديه منصة إلكترونية لحجز و عرض المكاتب على سبيل
          المثال مرخصة من وزارة السياحة، و حيث أن الطرف الثاني يملك أو يدير
          مكتبا معداً للتأجير و يرغب بالإعلان عنه في منصة الطرف الأول، لذا إتفق
          الطرفان وهما بكامل أهليتهما المعتبرة شرعاً ونظاماً على إبرام هذة
          الاتفاقية وفقاً للآتي:
        </p>
        <b>الماد (1): تمهيد:</b>
        <p>
          يُعتبر التمهيد أعلاه جزءاً لا يتجزأ من هذة الاتفاقية ومكملاً ومتمماً
          لها
        </p>
        <b>المادة (2): الغرض من هذة الاتفاقية:</b>
        <p>
          أبرمت هذة الاتفاقية لغرض قيام الطرف الثاني بالإعلان عن مكتبه في منصة
          الطرف الأول أو في منصات آخرى كما يراه الطرف الأول مناسبا وفقاً لنطاق
          الأمور المتفق عليها في هذة الاتفاقية وبعمولة متفق عليها من قبل
          الطرفين.
        </p>
        <b>المادة (3): إلتزامات و حقوق الطرف الأول:</b>
        <ul>
          <li>
            يلتزم الطرف الأول بتحصيل العربون أو كامل المبلغ من العميل، أما
            إستكمال باقي المبلغ (إن وجد) و مبلغ التأمين على المكتب يعتبر من
            إلتزامات الطرف الثاني.
          </li>
          <li>
            يلتزم الطرف الأول بإخبار الطرف الثاني بأي مستجدات في المنصة المتعلقة
            بطريقة إستخدامها للطرف الثاني
          </li>
          <li>يحق للطرف الأول عرض العقار بما يتناسب مع معاييره و متطلباته.</li>
          <li>
            يلتزم الطرف الأول بتطبيق سياسة الإلغاء التي يختارها الطرف الثاني في
            المنصة و سيعتمدها الطرف الأول لديه كسياسة إلغاء و إسترجاع للحجوزات.
            و لايحق للطرف الثاني الرجوع عنها بعد إتمام الحجز.
          </li>
        </ul>
        <b>المادة (4): إلتزامات الطرف الثاني:</b>
        <ul>
          <li>
            كل المعلومات التي سيُعلن عنها الطرف الثاني في منصة الطرف الأول ستكون
            ظاهرة للعملاء وسيُعتمد عليها لإجراء الحجوزات. لذلك يلتزم الطرف
            الثاني بأن يبيّن كافة المعلومات الصحيحة و الدقيقة للعقار بما في ذلك
            على سبيل المثال لا الحصر (الأسعار والتوافر والصور ووصف المكان و
            المرافق والخدمات التي يقدمها و شروط الحجز و غيرها من المعلومات التي
            تخص العقار)، و يلتزم بمتابعة وتجديد بيانات عقاره في حال حدث أي تغيير
            من قبله،
            <span style={{ color: "red" }}>
              {" "}
              فهو المسؤول عن صحة هذة المعلومات .
            </span>
          </li>
          <li>
            يجب أن
            <span style={{ color: "red" }}>
              {" "}
              تكون الأسعار المعروضة في المنصة تساوي أو أقل من الأسعار خارج
              المنصة
            </span>
            و لا يجوز أن تكون الأسعار في المنصة أعلى.
          </li>
          <li>
            <span style={{ color: "red" }}>
              يلتزم الطرف الثاني بتوفير ما تم حجزه في تاريخ الحجز عن طريق
              المنصة،
            </span>
            و أن يبذل قصارى جهده في ذلك، وفي حال تعذّر تسليم العين المحجوز ة
            لظروف قاهرة في ذات اليوم، سيقوم الطرف الأول بعمل حجز آخر بقيمة 150٪
            من قيمة الحجز الأصلي، و سيتحمل الطرف الثاني قيمة 50% من الحجز الآخر.
          </li>
          <li>
            لا يحق للطرف الثاني إلغاء أي حجز تم عن طريق الطرف الأول، و إذا ألغى
            الطرف الثاني الحجز حق للطرف الأول إعادة مبلغ العربون كاملاً للعميل،
            و يحق للطرف الأول في هذة الحالة خصم عمولته من حساب الطرف الثاني
            الموجود لدى الطرف الأول.
          </li>
        </ul>
        <b>المادة (5): العمولة وسداد المبلغ:</b>
        <ul>
          <li>
            تكون عمولة الطرف الأول مقابل كل حجز للطرف الثاني هي 13.04% من قيمة
            الإيجار. ( غير شاملة ضريبة القيمة المضافة)
          </li>
          <li>
            في حال لم يحضر العميل تحسب عمولة الطرف الأول من العربون و ليس من
            قيمة الإيجار.
          </li>
          <li>
            تصدر الفاتورة في تاريخ مغادرة العميل. وتحسم العمولة المتفق عليها و
            تحول المبالغ بعد 48 ساعة من تاريخ مغادرة العميل على حساب الطرف
            الثاني لدى (stcpay).
          </li>
        </ul>
        <b>المادة (6): الأحداث القهرية والضرر:</b>
        <ul>
          <li>
            لا يتحمل الطرف الأول أي مسؤولية عن إتلاف أو تخريب أو سرقة العقار أو
            المتبقي من المبلغ وما إلى ذلك من ممتلكات الطرف الثاني حيث أن مبلغ
            التأمين يدفع للطرف الثاني فهو المخول بمطالبة العميل عن أي تعويض
          </li>
          <li>
            يخلي الطرف الأول مسؤوليته عن أي حوادث تقع داخل العين المحجوزة من موت
            لا سمح الله أو غرق أو حريق أو جناية أو مداهمة حيث أن ثبوتيات العميل
            تكون بحوزة الطرف الثاني وهو المتصرف بها.
          </li>
        </ul>
        <b>المادة (7): مدة الاتفاقية:</b>
        <ul>
          <li>
            تسري هذة الاتفاقية ما دام عقار الطرف الثاني معروضاً على المنصة و
            تنتهي و تفسخ هذة الاتفاقية بمجرد تغيير حالة عرض عقار الطرف الثاني
            إلى غير معروض.
          </li>
          <li>
            في حال رغب أي من الطرفين فسخ و إلغاء الاتفاقية، يتم تسوية كافة
            الاستحقاقات و إلغاء الاتفاقية.
          </li>
        </ul>
        <b>المادة (8): أحكام عامة:</b>
        <ul>
          <li>
            تسري على كل ما لم يرد فيه نصٌ خاص في هذة الاتفاقية الأنظمة واللوائح
            والتعليمات والقرارات والتنظيمات ذات العلاقة السارية في المملكة
            العربية السعودية أثناء إبرام هذة الاتفاقية أو خلال فترة سريانها.
          </li>
        </ul>
        <b>المادة (9): الإشعارات:</b>
        <ul>
          <li>
            توجَّه كافة المراسلات والإشعارات والإخطارات المتعلقة بهذة الاتفاقية
            أو أي جزءٍ منها إلى العناوين المنوه عنها في مقدمة هذة الاتفاقية،
            وتُعد مستلمة حُكماً ومُنتجةً لآثارها القانونية إذا ثبت توجيهها
            وإرسالها إلى تلك العناوين بما في ذلك عنوان البريد الإلكتروني و
            تنبيهات تطبيق الجوال (جاذر إن للأعمال).
          </li>
        </ul>
        <b>المادة (10): النزاعات والخلافات:</b>
        <ul>
          <li>
            في حال نشوء نزاع بين أطراف هذة الاتفاقية أو بينهم وبين ورثة أحدٍ
            منهم أو خُلفائه من بعده وكان النزاع متعلقاً بهذة الاتفاقية أو ما
            ينشأ عنها أو بسببها من حقوقٍ أو التزامات، يتم حل هذا النزاع بالطرق
            الودِّية.
          </li>
          <li>
            في حال تعذر حل النزاع بين أطراف هذة الاتفاقية أو بينهم وبين ورثة
            أحدٍ منهم أو خُلفائه من بعده بالطرق الودية خلال (15) يوماً تقويمياً
            من تاريخ نشوء النزاع؛ يكون الاختصاص الولائي بالفصل في النزاع للمحكمة
            المختصة في مدينة الرياض.
          </li>
        </ul>
        <b>المادة (11): نسخ الاتفاقية</b>
        <p>
          حُرر ت هذة الاتفاقية من نسختين أصليتين متساويتان في القوة والحجية
          تتكون كل نسخة من إحدى عشر (11) مادة، وإستلم كل طرفٍ نسخة إلكترونية منه
          بعد الموافقة عليها إلكترونياً لتنفيذها والعمل بموجبها، ويُعد تاريخ
          موافقة الطرف الثاني هو تاريخ بدء سريان هذه الاتفاقية. والله الموفق،،،
        </p>
      </div>
    </div>
  );
};

export default TermOfService;
