import React from "react";
import styles from "../../../assets/css/home.module.css";
import { Typography, Container } from "@mui/material";
import { Home1, BG } from "../../../assets/images";
import { Link } from "react-router-dom";
import { useTranslation } from "react-i18next";

const AboutUs = () => {
  const { t, i18n } = useTranslation();
  return (
    <>
      <Container>
        <p className={styles.headingStyle}> {t("about_us.aboutus")}</p>
        <div className={styles.pExplain}>
          <p>
            تطبيق ومنصة مكتب هو لتأجير المكاتب المشتركة والمكاتب المؤثثة في
            المملكة العربية السعودية. يقدم الموقع حلاً مرنًا للشركات والعاملين
            الحر ورواد الأعمال الذين يبحثون عن مكان مريح ومجهز بكافة الخدمات
            المهمة لممارسة أعمالهم.
          </p>
          <p className="mt-5">
            يوفر تطبيق ومنصة مكتب مجموعة واسعة من المكاتب المختلفة، من المكاتب
            الصغيرة للفرد إلى مكاتب الفرق الكبيرة. بالإضافة إلى ذلك، يوفر مكتب
            العديد من الخدمات الإضافية مثل خدمة الاستقبال، وخدمة الاتصال
            الهاتفي، والاجتماعات والمؤتمرات،
          </p>
          <p className="mt-5">
            وخدمات الطباعة والمسح الضوئي، والواي فاي عالي السرعة، وغيرها. تتواجد
            مكاتب مكتب في مختلف المدن والمناطق في المملكة العربية السعودية، مما
            يسهل الوصول إليها وتلبية احتياجات العملاء المختلفة.
          </p>
          <p className="mt-5">
            يوفر منصة وتطبيق مكتب بيئة عمل مريحة ومجهزة بكافة الخدمات الضرورية
            للأفراد والشركات. يتوفر لدى مكتب تشكيلة واسعة من المكاتب المختلفة
            حجمًا وتصميمًا، بدءًا من المكاتب الفردية الصغيرة إلى المكاتب الكبيرة
            للفرق العاملة. بالإضافة إلى ذلك، خدمات إضافية مثل خدمة الاستقبال
            والاتصال الهاتفي وتنظيم الاجتماعات والمؤتمرات وخدمات الطباعة والمسح
            الضوئي والواي فاي عالي السرعة . يتم توفير اعلانات المكاتب في عدة
            مواقع في المملكة العربية السعودية، مما يتيح سهولة الوصول وتلبية
            احتياجات مختلف العملاء.
          </p>
          <p className="mt-5">
            التطبيق يجمع بين أصحاب المكاتب والمستأجرين، ويوفر لهم خدمات مثل
            التعاقد الآمن والتأجير الآمن. يحتوي التطبيق على عدة أقسام، بما في
            ذلك المكاتب المشتركة والمكاتب المستقلة والمكاتب المتحركة، والتي
            تعتبر خدمة جديدة حيث تتمثل في استخدام سيارات مجهزة بالمكاتب.
          </p>
          <p className="mt-5">
            يوفر التطبيق أيضًا خدمات شركات تجهيز المكاتب المشتركة مثل التصميم
            والتنفيذ والتجهيز الى الترخيص وما إلى ذلك.
          </p>
          <p className="mt-5">
            نقدم مجموعة واسعة من المكاتب الفاخرة والمؤثثة للتأجير اليومي والشهري
            والسنوي. يمكنك الاختيار من بين مجموعة متنوعة من التصاميم والأحجام
            التي تناسب احتياجاتك الشخصية أو احتياجات شركتك.{" "}
          </p>
          <p className="mt-5">
            مكتب يوفر العديد من الأقسام التي تهدف إلى تيسير عملية نشر الإعلانات
            واستقبال طلبات التأجير، بالإضافة إلى توفير قسم مخصص للأسعار والعروض
            المتاحة. هناك أيضًا قسم يهتم بالعقود الإلكترونية المرتبطة بمنصة
            إيجار، كما يوجد تنظيم مالي بين المستأجر والمؤجر، بالإضافة إلى قسم
            مالي خاص يوفر للمؤجر احصائيات كاملة حول الإيجارات والمستحق لهم من
            قبل المكتب.
          </p>
          <p className="mt-5">
            نحن في مكتب نهتم بتقديم خدمات شاملة لعملائنا ونسعى جاهدين لتحقيق
            رضاهم.
          </p>
          <p className="mt-5">
            لا تتردد في التواصل معنا للمزيد من التفاصيل ولحجز مكتب مميز يلبي
            احتياجاتك.
          </p>
        </div>
      </Container>
      <div className={styles.imgContainerAbor}>
        <div className={styles.divImgContent}>
          <Typography className={styles.headingStyle}>
            {t("about_us.tryhostig")}
          </Typography>
          <p className={styles.maktabParagraph}>{t("about_us.maktab")}</p>
          <p className={styles.addoffice}>{t("about_us.addoffice")}</p>
          <Link to="/addoffice" className={styles.registerofficeBtn}>
            {t("about_us.reg_office")}
          </Link>
        </div>
        <img src={Home1} className={styles.imgStyle} />
      </div>
    </>
  );
};

export default AboutUs;
